Revit 2024 API
ParameterTypeId.StructConnectionTypeName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructConnectionTypeName { get; }
Visual Basic
Public Shared ReadOnly Property StructConnectionTypeName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructConnectionTypeName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace